analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32662/Include/adc_regs.h
#define MXC_F_ADC_CHSEL0_SLOT2_ID_POS                  16 /**< CHSEL0_SLOT2_ID Position */
#define MXC_F_ADC_CHSEL0_SLOT2_ID                      ((uint32_t)(0x1FUL << MXC_F_ADC_CHSEL0_SLOT2_ID_POS)) /**< CHSEL0_SLOT2_ID Mask */

#define MXC_F_ADC_CHSEL0_SLOT3_ID_POS                  24 /**< CHSEL0_SLOT3_ID Position */
#define MXC_F_ADC_CHSEL0_SLOT3_ID                      ((uint32_t)(0x1FUL << MXC_F_ADC_CHSEL0_SLOT3_ID_POS)) /**< CHSEL0_SLOT3_ID Mask */

/**@} end of group ADC_CHSEL0_Register */

/**
 * @ingroup  adc_registers
 * @defgroup ADC_CHSEL1 ADC_CHSEL1
 * @brief    Channel Select Register 1.
 * @{
 */
#define MXC_F_ADC_CHSEL1_SLOT4_ID_POS                  0 /**< CHSEL1_SLOT4_ID Position */
#define MXC_F_ADC_CHSEL1_SLOT4_ID                      ((uint32_t)(0x1FUL << MXC_F_ADC_CHSEL1_SLOT4_ID_POS)) /**< CHSEL1_SLOT4_ID Mask */

#define MXC_F_ADC_CHSEL1_SLOT5_ID_POS                  8 /**< CHSEL1_SLOT5_ID Position */
#define MXC_F_ADC_CHSEL1_SLOT5_ID                      ((uint32_t)(0x1FUL << MXC_F_ADC_CHSEL1_SLOT5_ID_POS)) /**< CHSEL1_SLOT5_ID Mask */

#define MXC_F_ADC_CHSEL1_SLOT6_ID_POS                  16 /**< CHSEL1_SLOT6_ID Position */
#define MXC_F_ADC_CHSEL1_SLOT6_ID                      ((uint32_t)(0x1FUL << MXC_F_ADC_CHSEL1_SLOT6_ID_POS)) /**< CHSEL1_SLOT6_ID Mask */

#define MXC_F_ADC_CHSEL1_SLOT7_ID_POS                  24 /**< CHSEL1_SLOT7_ID Position */
#define MXC_F_ADC_CHSEL1_SLOT7_ID                      ((uint32_t)(0x1FUL << MXC_F_ADC_CHSEL1_SLOT7_ID_POS)) /**< CHSEL1_SLOT7_ID Mask */

/**@} end of group ADC_CHSEL1_Register */

/**
 * @ingroup  adc_registers
 * @defgroup ADC_CHSEL2 ADC_CHSEL2
 * @brief    Channel Select Register 2.
 * @{
 */
#define MXC_F_ADC_CHSEL2_SLOT8_ID_POS                  0 /**< CHSEL2_SLOT8_ID Position */
#define MXC_F_ADC_CHSEL2_SLOT8_ID                      ((uint32_t)(0x1FUL << MXC_F_ADC_CHSEL2_SLOT8_ID_POS)) /**< CHSEL2_SLOT8_ID Mask */

#define MXC_F_ADC_CHSEL2_SLOT9_ID_POS                  8 /**< CHSEL2_SLOT9_ID Position */
#define MXC_F_ADC_CHSEL2_SLOT9_ID                      ((uint32_t)(0x1FUL << MXC_F_ADC_CHSEL2_SLOT9_ID_POS)) /**< CHSEL2_SLOT9_ID Mask */

#define MXC_F_ADC_CHSEL2_SLOT10_ID_POS                 16 /**< CHSEL2_SLOT10_ID Position */
#define MXC_F_ADC_CHSEL2_SLOT10_ID                     ((uint32_t)(0x1FUL << MXC_F_ADC_CHSEL2_SLOT10_ID_POS)) /**< CHSEL2_SLOT10_ID Mask */

#define MXC_F_ADC_CHSEL2_SLOT11_ID_POS                 24 /**< CHSEL2_SLOT11_ID Position */
#define MXC_F_ADC_CHSEL2_SLOT11_ID                     ((uint32_t)(0x1FUL << MXC_F_ADC_CHSEL2_SLOT11_ID_POS)) /**< CHSEL2_SLOT11_ID Mask */

/**@} end of group ADC_CHSEL2_Register */

/**
 * @ingroup  adc_registers
 * @defgroup ADC_CHSEL3 ADC_CHSEL3
 * @brief    Channel Select Register 3.
 * @{
 */
#define MXC_F_ADC_CHSEL3_SLOT12_ID_POS                 0 /**< CHSEL3_SLOT12_ID Position */
#define MXC_F_ADC_CHSEL3_SLOT12_ID                     ((uint32_t)(0x1FUL << MXC_F_ADC_CHSEL3_SLOT12_ID_POS)) /**< CHSEL3_SLOT12_ID Mask */

#define MXC_F_ADC_CHSEL3_SLOT13_ID_POS                 8 /**< CHSEL3_SLOT13_ID Position */
#define MXC_F_ADC_CHSEL3_SLOT13_ID                     ((uint32_t)(0x1FUL << MXC_F_ADC_CHSEL3_SLOT13_ID_POS)) /**< CHSEL3_SLOT13_ID Mask */

#define MXC_F_ADC_CHSEL3_SLOT14_ID_POS                 16 /**< CHSEL3_SLOT14_ID Position */
#define MXC_F_ADC_CHSEL3_SLOT14_ID                     ((uint32_t)(0x1FUL << MXC_F_ADC_CHSEL3_SLOT14_ID_POS)) /**< CHSEL3_SLOT14_ID Mask */

#define MXC_F_ADC_CHSEL3_SLOT15_ID_POS                 24 /**< CHSEL3_SLOT15_ID Position */
#define MXC_F_ADC_CHSEL3_SLOT15_ID                     ((uint32_t)(0x1FUL << MXC_F_ADC_CHSEL3_SLOT15_ID_POS)) /**< CHSEL3_SLOT15_ID Mask */

/**@} end of group ADC_CHSEL3_Register */

/**
 * @ingroup  adc_registers
 * @defgroup ADC_RESTART ADC_RESTART
 * @brief    Restart Count Control Register
 * @{
 */
#define MXC_F_ADC_RESTART_CNT_POS                      0 /**< RESTART_CNT Position */
#define MXC_F_ADC_RESTART_CNT                          ((uint32_t)(0xFFFFUL << MXC_F_ADC_RESTART_CNT_POS)) /**< RESTART_CNT Mask */

/**@} end of group ADC_RESTART_Register */

/**
 * @ingroup  adc_registers
 * @defgroup ADC_DATAFMT ADC_DATAFMT
 * @brief    Channel Data Format Register
 * @{
 */
#define MXC_F_ADC_DATAFMT_MODE_POS                     0 /**< DATAFMT_MODE Position */
#define MXC_F_ADC_DATAFMT_MODE                         ((uint32_t)(0xFFFFFFFFUL << MXC_F_ADC_DATAFMT_MODE_POS)) /**< DATAFMT_MODE Mask */

/**@} end of group ADC_DATAFMT_Register */

/**
 * @ingroup  adc_registers
 * @defgroup ADC_FIFODMACTRL ADC_FIFODMACTRL
 * @brief    FIFO and DMA control
 * @{
 */
#define MXC_F_ADC_FIFODMACTRL_DMA_EN_POS               0 /**< FIFODMACTRL_DMA_EN Position */
#define MXC_F_ADC_FIFODMACTRL_DMA_EN                   ((uint32_t)(0x1UL << MXC_F_ADC_FIFODMACTRL_DMA_EN_POS)) /**< FIFODMACTRL_DMA_EN Mask */

#define MXC_F_ADC_FIFODMACTRL_FLUSH_POS                1 /**< FIFODMACTRL_FLUSH Position */
#define MXC_F_ADC_FIFODMACTRL_FLUSH                    ((uint32_t)(0x1UL << MXC_F_ADC_FIFODMACTRL_FLUSH_POS)) /**< FIFODMACTRL_FLUSH Mask */

#define MXC_F_ADC_FIFODMACTRL_DATA_FORMAT_POS          2 /**< FIFODMACTRL_DATA_FORMAT Position */
#define MXC_F_ADC_FIFODMACTRL_DATA_FORMAT              ((uint32_t)(0x3UL << MXC_F_ADC_FIFODMACTRL_DATA_FORMAT_POS)) /**< FIFODMACTRL_DATA_FORMAT Mask */
#define MXC_V_ADC_FIFODMACTRL_DATA_FORMAT_DATA_STATUS  ((uint32_t)0x0UL) /**< FIFODMACTRL_DATA_FORMAT_DATA_STATUS Value */
#define MXC_S_ADC_FIFODMACTRL_DATA_FORMAT_DATA_STATUS  (MXC_V_ADC_FIFODMACTRL_DATA_FORMAT_DATA_STATUS << MXC_F_ADC_FIFODMACTRL_DATA_FORMAT_POS) /**< FIFODMACTRL_DATA_FORMAT_DATA_STATUS Setting */
#define MXC_V_ADC_FIFODMACTRL_DATA_FORMAT_DATA_ONLY    ((uint32_t)0x1UL) /**< FIFODMACTRL_DATA_FORMAT_DATA_ONLY Value */
#define MXC_S_ADC_FIFODMACTRL_DATA_FORMAT_DATA_ONLY    (MXC_V_ADC_FIFODMACTRL_DATA_FORMAT_DATA_ONLY << MXC_F_ADC_FIFODMACTRL_DATA_FORMAT_POS) /**< FIFODMACTRL_DATA_FORMAT_DATA_ONLY Setting */
#define MXC_V_ADC_FIFODMACTRL_DATA_FORMAT_RAW_DATA_ONLY ((uint32_t)0x2UL) /**< FIFODMACTRL_DATA_FORMAT_RAW_DATA_ONLY Value */
#define MXC_S_ADC_FIFODMACTRL_DATA_FORMAT_RAW_DATA_ONLY (MXC_V_ADC_FIFODMACTRL_DATA_FORMAT_RAW_DATA_ONLY << MXC_F_ADC_FIFODMACTRL_DATA_FORMAT_POS) /**< FIFODMACTRL_DATA_FORMAT_RAW_DATA_ONLY Setting */

