analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32662/Include/adc_regs.h
#define MXC_F_ADC_INTFL_CONV_DONE_POS                  6 /**< INTFL_CONV_DONE Position */
#define MXC_F_ADC_INTFL_CONV_DONE                      ((uint32_t)(0x1UL << MXC_F_ADC_INTFL_CONV_DONE_POS)) /**< INTFL_CONV_DONE Mask */

#define MXC_F_ADC_INTFL_CLIPPED_POS                    7 /**< INTFL_CLIPPED Position */
#define MXC_F_ADC_INTFL_CLIPPED                        ((uint32_t)(0x1UL << MXC_F_ADC_INTFL_CLIPPED_POS)) /**< INTFL_CLIPPED Mask */

#define MXC_F_ADC_INTFL_FIFO_LVL_POS                   8 /**< INTFL_FIFO_LVL Position */
#define MXC_F_ADC_INTFL_FIFO_LVL                       ((uint32_t)(0x1UL << MXC_F_ADC_INTFL_FIFO_LVL_POS)) /**< INTFL_FIFO_LVL Mask */

#define MXC_F_ADC_INTFL_FIFO_UFL_POS                   9 /**< INTFL_FIFO_UFL Position */
#define MXC_F_ADC_INTFL_FIFO_UFL                       ((uint32_t)(0x1UL << MXC_F_ADC_INTFL_FIFO_UFL_POS)) /**< INTFL_FIFO_UFL Mask */

#define MXC_F_ADC_INTFL_FIFO_OFL_POS                   10 /**< INTFL_FIFO_OFL Position */
#define MXC_F_ADC_INTFL_FIFO_OFL                       ((uint32_t)(0x1UL << MXC_F_ADC_INTFL_FIFO_OFL_POS)) /**< INTFL_FIFO_OFL Mask */

/**@} end of group ADC_INTFL_Register */

/**
 * @ingroup  adc_registers
 * @defgroup ADC_SFRADDROFFSET ADC_SFRADDROFFSET
 * @brief    SFR Address Offset Register
 * @{
 */
#define MXC_F_ADC_SFRADDROFFSET_OFFSET_POS             0 /**< SFRADDROFFSET_OFFSET Position */
#define MXC_F_ADC_SFRADDROFFSET_OFFSET                 ((uint32_t)(0xFFUL << MXC_F_ADC_SFRADDROFFSET_OFFSET_POS)) /**< SFRADDROFFSET_OFFSET Mask */

/**@} end of group ADC_SFRADDROFFSET_Register */

/**
 * @ingroup  adc_registers
 * @defgroup ADC_SFRADDR ADC_SFRADDR
 * @brief    SFR Address Register
 * @{
 */
#define MXC_F_ADC_SFRADDR_ADDR_POS                     0 /**< SFRADDR_ADDR Position */
#define MXC_F_ADC_SFRADDR_ADDR                         ((uint32_t)(0xFFUL << MXC_F_ADC_SFRADDR_ADDR_POS)) /**< SFRADDR_ADDR Mask */

/**@} end of group ADC_SFRADDR_Register */

/**
 * @ingroup  adc_registers
 * @defgroup ADC_SFRWRDATA ADC_SFRWRDATA
 * @brief    SFR Write Data Register
 * @{
 */
#define MXC_F_ADC_SFRWRDATA_DATA_POS                   0 /**< SFRWRDATA_DATA Position */
#define MXC_F_ADC_SFRWRDATA_DATA                       ((uint32_t)(0xFFUL << MXC_F_ADC_SFRWRDATA_DATA_POS)) /**< SFRWRDATA_DATA Mask */

/**@} end of group ADC_SFRWRDATA_Register */

/**
 * @ingroup  adc_registers
 * @defgroup ADC_SFRRDDATA ADC_SFRRDDATA
 * @brief    SFR Read Data Register
 * @{
 */
#define MXC_F_ADC_SFRRDDATA_DATA_POS                   0 /**< SFRRDDATA_DATA Position */
#define MXC_F_ADC_SFRRDDATA_DATA                       ((uint32_t)(0xFFUL << MXC_F_ADC_SFRRDDATA_DATA_POS)) /**< SFRRDDATA_DATA Mask */

/**@} end of group ADC_SFRRDDATA_Register */

/**
 * @ingroup  adc_registers
 * @defgroup ADC_SFRSTATUS ADC_SFRSTATUS
 * @brief    SFR Status Register
 * @{
 */
#define MXC_F_ADC_SFRSTATUS_NACK_POS                   0 /**< SFRSTATUS_NACK Position */
#define MXC_F_ADC_SFRSTATUS_NACK                       ((uint32_t)(0x1UL << MXC_F_ADC_SFRSTATUS_NACK_POS)) /**< SFRSTATUS_NACK Mask */

/**@} end of group ADC_SFRSTATUS_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32662_INCLUDE_ADC_REGS_H_
